backend/app/controllers/board_users_controller.rb

  def index
    @board_users = BoardUser.all
---
SELECT "board_users".* FROM "board_users"

  def create
    @board_user = BoardUser.new(board_user_params)

    if @board_user.save
---
INSERT INTO "board_users" ("board_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["board_id", 980190962], ["user_id", 980190962], ["created_at", "2020-12-25 19:37:09.774350"], ["updated_at", "2020-12-25 19:37:09.774350"]]

  def destroy
    @board_user.destroy
---
DELETE FROM "board_users" WHERE "board_users"."id" = $1  [["id", 980190962]]

    def set_board_user
      @board_user = BoardUser.find(params[:id])
---
SELECT "board_users".* FROM "board_users" WHERE "board_users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]