backend/app/controllers/boards_controller.rb

    def create
        @board = Board.new(board_params)

        if @board.save
---
INSERT INTO "boards" ("user_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 980190962], ["name", "MyString"], ["description", "MyText"], ["created_at", "2020-12-24 05:57:26.429126"], ["updated_at", "2020-12-24 05:57:26.429126"]]