backend/app/controllers/cards_controller.rb

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 980190962]]
---
  def destroy
    @card.destroy