backend/app/controllers/swim_lanes_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "swim_lanes".* FROM "swim_lanes"
---
    def index
        if params[:board]
            @board = Board.find_by(id: params[:board])
            @swim_lanes = @board.swim_lanes
        else
            @swim_lanes = SwimLane.all

DELETE FROM "swim_lanes" WHERE "swim_lanes"."id" = $1  [["id", 980190962]]
---
    def destroy
        @swim_lane.destroy

SELECT "swim_lanes".* FROM "swim_lanes" WHERE "swim_lanes"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_swim_lane
        @swim_lane = SwimLane.find(params[:id])